# Brewfile :: jcopp
#
# Run `brew bundle` from same dir as this file
#
#=-----------------------------------------------------------------------------

cask_args appdir: '/Applications'

# official repos
tap 'homebrew/cask'
tap 'homebrew/bundle'

# essential utils
brew 'bash'
brew 'coreutils'
brew 'git'
brew 'lua'
brew 'tmux'
brew 'vim'

# go, python, ruby, rust
brew 'golang'
brew 'python'
brew 'python3'
brew 'ruby'
brew 'rust'

# handy improvers of life
brew 'awscli'
brew 'bat'
brew 'cfn-lint'
brew 'choose-rust'
brew 'colordiff'
brew 'emojify'
brew 'fd'
brew 'fzf'
brew 'ghi'
brew 'git-delta'
brew 'go-jira'
brew 'grc'
brew 'helm'
brew 'htop-osx'
brew 'hub'
brew 'jq'
brew 'node'
brew 'openshift-cli'
brew 'openssl'
brew 'pstree'
brew 'python-yq'
brew 'readline'
brew 'reattach-to-user-namespace'
brew 'ripgrep'
brew 'shellcheck'
brew 'speedtest-cli'
brew 'ssh-copy-id'
brew 'terraform'
brew 'terraform-docs'
brew 'tflint'
brew 'tig'
brew 'tree'
brew 'watch'
brew 'wget'
brew 'xsv'

# completions
brew 'bash-completion@2'
brew 'django-completion'
brew 'docker-completion'
brew 'docker-compose-completion'
brew 'docker-machine-completion'
brew 'gem-completion'
brew 'packer-completion'
brew 'pip-completion'
brew 'vagrant-completion'
brew 'yarn-completion'

# misc libs and tools
brew 'xz'

# keyboard firmware
brew 'qmk/qmk/qmk'

# space age sed
tap 'ms-jpq/sad'
brew 'sad'

# cloudsplain
tap 'salesforce/cloudsplaining'
brew 'cloudsplaining'

# manage local creds
cask 'aws-vault'

# jira interactive cli
# this looks interesting but conflicts with `go-jira` so commenting out for now
#tap 'ankitpokhrel/jira-cli'
#brew 'jira-cli'

