# Brewfile :: jcopp
#
#~/\~--------------------------------------------------------------------------
#
# Run `brew bundle` from same dir as this file
#
#=-----------------------------------------------------------------------------
#`

# where to install casks, override e.g. chrome on mac default of ~/Applications
cask_args appdir: '/Applications'

# official repos
tap 'homebrew/bundle'

# essential utils
brew 'bash'
brew 'coreutils'
brew 'findutils'
brew 'git'
brew 'lua'
brew 'tmux'
brew 'vim'

# go, python, ruby, rust
brew 'golang'
brew 'python'
brew 'python3'
brew 'ruby'
brew 'rust'

# handy improvers of life
brew 'ansible'
brew 'awscli'
brew 'awscurl'
brew 'bandwhich'
brew 'bat'
brew 'black'
brew 'bpython'
brew 'btop'
brew 'cfn-lint'
brew 'choose-rust'
brew 'colordiff'
brew 'duf'
brew 'emojify'
brew 'exiftool'
brew 'fd'
brew 'ffmpeg'
brew 'flac'
brew 'fx'
brew 'fzf'
brew 'gawk'
brew 'gh'
brew 'ghi'
brew 'git-delta'
brew 'gitui'
brew 'glow'
brew 'gnu-sed'
brew 'goaccess'
brew 'go-jira'
brew 'grc'
brew 'helm'
brew 'htop'
brew 'httpie'
brew 'hub'
brew 'ipython'
brew 'jaq'
brew 'jless'
brew 'jq'
brew 'jsonlint'
brew 'llm'
brew 'mtr'
brew 'ncdu'
brew 'nmap'
brew 'node'
brew 'openshift-cli'
brew 'openssl'
brew 'pstree'
brew 'pyenv'
brew 'python-yq'
brew 'readline'
brew 'reattach-to-user-namespace'
brew 'rga'
brew 'ripgrep'
brew 'rsync'
brew 'shellcheck'
brew 'speedtest-cli'
brew 'ssh-copy-id'
brew 'subnetcalc'
brew 'tig'
brew 'tree'
brew 'uv'
brew 'watch'
brew 'wget'
brew 'xsv'

# terraform - use tfenv to manage binaries
# e.g. `tfenv install 1.5.5 && tfenv use 1.5.5`
brew 'iam-policy-json-to-terraform'
brew 'terraform-docs'
brew 'tfenv'
brew 'tfk8s'
brew 'tflint'
brew 'tfsec'

# k8s
brew 'argocd'
brew 'k9s'
brew 'kube-ps1'
brew 'kubernetes-cli'
brew 'kubectx'

# docker
brew 'docker'
brew 'colima'

# completions
brew 'bash-completion@2'
brew 'django-completion'
brew 'docker-completion'
brew 'gem-completion'
brew 'pip-completion'
brew 'yarn-completion'

# misc libs, tools, db, etc
brew 'duckdb'
brew 'sqlite'
brew 'xz'

# keyboard firmware
brew 'qmk/qmk/qmk'

# space age sed
tap 'ms-jpq/sad'
brew 'sad'

# helm chart releases
tap 'helm/tap'
brew 'chart-releaser'

# charm toolset
tap 'charmbracelet/tap'
brew 'charm'

# manage local creds
cask 'aws-vault'

# other casks
cask '1password-cli'
cask 'chromedriver'
cask 'dash'
cask 'karabiner-elements'
cask 'macdown'
cask 'obsidian'

# fasd
# brew 'fasd' # manually install until brew updates formula

# other apps not installable via brew
#
# homerow         https://www.homerow.app/
# docker desktop  https://docs.docker.com/desktop/install/mac-install/
# alfred          https://alfredapp.com
# dropbox         https://dropbox.com
#
