cask_args appdir: '/Applications'

tap 'caskroom/cask'
tap 'homebrew/bundle'

# essential utils
brew 'bash'
brew 'coreutils'
brew 'git'
brew 'lua'
brew 'tmux'
brew 'vim', args: ['with-lua']

# python and ruby
brew 'python'
brew 'python3'
brew 'ruby'

# handy improvers of life
brew 'ack'
brew 'colordiff'
brew 'emojify'
brew 'fzf'
brew 'ghi'
brew 'grc'
brew 'htop-osx'
brew 'hub'
brew 'jq'
brew 'node'
brew 'openssl'
brew 'phantomjs'
brew 'pstree'
brew 'readline'
brew 'reattach-to-user-namespace'
brew 'ripgrep'
brew 'speedtest-cli'
brew 'ssh-copy-id'
brew 'tig'
brew 'tree'
brew 'watch'
brew 'wget'

# misc libs and tools
brew 'autoconf'
brew 'automake'
brew 'gawk'
brew 'gdbm'
brew 'john'
brew 'libtool'
brew 'libyaml'
brew 'lnav'
brew 'multitail'
brew 'ncdu'
brew 'nmap'
brew 'openssl'
brew 'pandoc'
brew 'pcre'
brew 'phantomjs'
brew 'pkg-config'
brew 'putty'
brew 'pwgen'
brew 'readline'
brew 'slimerjs'
brew 'sqlite'
brew 'wrk'
brew 'xz'

# compiled apps
cask 'atom'
cask 'firefox'
cask 'google-chrome'
cask 'iterm2'
cask 'slack'
cask 'spotify'
cask 'sublime-text'

# app store
mas 'TypeIt4Me', id: 412141729
mas 'AntiSleep', id: 946798523
